Конфигурация/Documents/Акцепт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Акцепт</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.АкцептованиеОпераций</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Акцептант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидАкцепта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыАкцептов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеКредитногоИнструмента</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоручениеНаДвижениеЦенныхБумаг</v8:Type>
						<v8:Type>cfg:DocumentRef.Распоряжение</v8:Type>
						<v8:Type>cfg:DocumentRef.СтрокаБанковскойВыписки</v8:Type>
						<v8:Type>cfg:DocumentRef.СделкаРЕПО</v8:Type>
						<v8:Type>cfg:DocumentRef.Оплата</v8:Type>
						<v8:Type>cfg:DocumentRef.МНО</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыБрокерскогоОбслуживания</v8:Type>
						<v8:Type>cfg:DocumentRef.ПереводДенежныхСредств</v8:Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
						<v8:Type>cfg:DocumentRef.СделкаСВалютой</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.Сделка</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоручениеНаДвижениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоручениеНаПереводДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Enums/ВидыАкцептов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыАкцептов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СписаниеКомиссииБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеБрокерскойКомиссии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеТорговойКомиссии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводСБрокерскогоСчетаНаРасчетный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СМО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласиеНаОферту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеНаВыводАктивов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МНОСрочный30Дней4ПроцентаУКПИ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/СтатусыПорученийНаПереводДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СтатусыПорученийНаПереводДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Активно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросНаОтмену</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Снято</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПриЭкспорте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетАкцепта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовКОтправке</Name>
					<Comment>Поручение готово к отправке в QUIK, либо к отправке в бэк-офис (в виде электронного письма) для исполнения </Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/Акцепт/Ext/ObjectModule.bsl
Процедура ПроведениеПоРегистрамБэкОфиса(Отказ) Экспорт
	
	РаботаСРегистрамиНакопления.ОчиститьДвиженияПоБэкофису(ЭтотОбъект);
	
	ДвиженияПоРегиструАкцептованиеОпераций(Отказ);	
	
	Движения.Записать();
		
КонецПроцедуры // ПроведениеПоРегистрамБэкОфиса

Процедура ДвиженияПоРегиструАкцептованиеОпераций(Отказ)
	
	Движения.АкцептованиеОпераций.Записывать = Истина;
	
	Движение = Движения.АкцептованиеОпераций.Добавить();
	
	ЗаполнитьЗначенияСвойств(Движение, ЭтотОбъект);
	Движение.Период 		= ЭтотОбъект.Дата;
	Движение.Операция 		= ЭтотОбъект.Объект;
	
КонецПроцедуры

#Область ОБРАБОТЧИКИ_СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);	
	
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;

	Основание = "";
	Если Не ДанныеЗаполнения.Свойство("Объект", Основание) Тогда
		Возврат;
	КонецЕсли;  
		
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения); 
		
	ТипОснования = ТипЗнч(Основание);
	
	Если ТипОснования = Тип("СправочникСсылка.Договоры")
		Или ТипОснования = Тип("СправочникСсылка.ДоговорыБрокерскогоОбслуживания") Тогда
		СтруктураЗаполнения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Основание, "Организация,ДатаЗаключения");
		СтруктураЗаполнения.Вставить("Дата", ТекущаяДата());
		
		// По умолчанию установим СписаниеБрокерскойКомиссии
		СтруктураЗаполнения.Вставить("ВидАкцепта", Перечисления.ВидыАкцептов.СписаниеБрокерскойКомиссии);
	ИначеЕсли ТипОснования = Тип("СправочникСсылка.БанковскиеСчета") Тогда
		
		ДанныеОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Основание, "Организация, Договор");
		СтруктураЗаполнения = Новый Структура("Организация, Дата", ДанныеОснования.Организация, ТекущаяДата());
		
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.СтрокаБанковскойВыписки") Тогда		
		
		СтруктураЗаполнения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Основание, "Организация");
		СчетДУ = ПолучитьСчетДУИзРеестраПлатежей(Основание);
		СтруктураЗаполнения.Вставить("СчетДоверительногоУправления", СчетДУ);
		
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ПоручениеНаПереводДенежныхСредств") Тогда
		
		СтруктураЗаполнения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Основание, "Организация, СчетДоверительногоУправления");
		СтруктураЗаполнения.Вставить("ВидАкцепта", Перечисления.ВидыАкцептов.ПереводСБрокерскогоСчетаНаРасчетный);

	ИначеЕсли ТипОснования = Тип("ДокументСсылка.Распоряжение") И ДанныеЗаполнения.Свойство("ДлинныйАкцепт") Тогда
		
		СтруктураЗаполнения = Новый Структура("Объект", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "РасчетныйСчет"));
		СтруктураЗаполнения.Вставить("ВидАкцепта", Перечисления.ВидыАкцептов.МНО); 
				
	Иначе
		СтруктураЗаполнения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Основание, "Организация, СчетДоверительногоУправления");
	КонецЕсли;
		
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтруктураЗаполнения);	
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не (ЭтотОбъект.ВидАкцепта = Перечисления.ВидыАкцептов.ПереводСБрокерскогоСчетаНаРасчетный 
			И ТипЗнч(ЭтотОбъект.Объект) = Тип("СправочникСсылка.ДоговорыБрокерскогоОбслуживания")) Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Срок"));	
	КонецЕсли;
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);

	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	ТипыКороткихАкцептов = Новый Массив;
	ТипыКороткихАкцептов.Добавить(Тип("ДокументСсылка.ЗакрытиеКредитногоИнструмента"));
	ТипыКороткихАкцептов.Добавить(Тип("ДокументСсылка.СтрокаБанковскойВыписки"));
	ТипыКороткихАкцептов.Добавить(Тип("ДокументСсылка.Сделка"));
	ТипыКороткихАкцептов.Добавить(Тип("ДокументСсылка.СделкаРЕПО"));
	ТипыКороткихАкцептов.Добавить(Тип("ДокументСсылка.МНО"));
	ТипыКороткихАкцептов.Добавить(Тип("ДокументСсылка.Распоряжение"));
	ТипыКороткихАкцептов.Добавить(Тип("ДокументСсылка.СделкаСВалютой"));
	ТипыКороткихАкцептов.Добавить(Тип("ДокументСсылка.ПоручениеНаПереводДенежныхСредств"));
	ТипыКороткихАкцептов.Добавить(Тип("ДокументСсылка.Оплата"));
	
	// Проверим, что вид акцепта соответствует объекту акцептования
	Если ВидАкцепта = Перечисления.ВидыАкцептов.ПустаяСсылка() И ТипыКороткихАкцептов.Найти(ТипЗнч(ЭтотОбъект.Объект)) = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СокрЛП(ЭтотОбъект.Объект) + " не соответстует виду акцепта [Короткий акцепт]!", ЭтотОбъект, "Объект",, Отказ);
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.ЭтоНовый Тогда 
	
		Если ВидАкцепта = Перечисления.ВидыАкцептов.ПереводСБрокерскогоСчетаНаРасчетный 
			И ТипЗнч(ЭтотОбъект.Объект) = Тип("ДокументСсылка.ПоручениеНаПереводДенежныхСредств") Тогда
 
			Если Не РаботаСДокументами.ТребуетсяАкцептованиеДокумента(ЭтотОбъект.Объект, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для документа [" + ЭтотОбъект.Объект + "] по счету д/у [" + ЭтотОбъект.СчетДоверительногоУправления + "] акцептование не требуется!", ЭтотОбъект, "Объект",, Отказ);
				Возврат;
			КонецЕсли; 
				
		ИначеЕсли ВидАкцепта = Перечисления.ВидыАкцептов.МНО И ТипЗнч(ЭтотОбъект.Объект) = Тип("ДокументСсылка.Распоряжение") Тогда
			
			Если Не РаботаСДокументами.ТребуетсяАкцептованиеДокумента(ЭтотОбъект.Объект, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Дата) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для документа [" + ЭтотОбъект.Объект + "] по счету д/у [" + ЭтотОбъект.СчетДоверительногоУправления + "] акцептование не требуется!", ЭтотОбъект, "Объект",, Отказ);
				Возврат;
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(ЭтотОбъект.Объект) = Тип("ДокументСсылка.МНО") Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя акцептовать документ МНО. Для акцептования необходимо создать распоряжение на МНО.", ЭтотОбъект, "Объект",, Отказ);
			Возврат;	
		КонецЕсли;
		
	КонецЕсли;
		
	Если ВидАкцепта = Перечисления.ВидыАкцептов.ПереводСБрокерскогоСчетаНаРасчетный
		И ТипЗнч(ЭтотОбъект.Объект) <> Тип("СправочникСсылка.ДоговорыБрокерскогоОбслуживания")
		И ТипЗнч(ЭтотОбъект.Объект) <> Тип("СправочникСсылка.Договоры")
		И ТипЗнч(ЭтотОбъект.Объект) <> Тип("ДокументСсылка.ПоручениеНаПереводДенежныхСредств") Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для вида акцепта [" + СокрЛП(ВидАкцепта) + "] в поле [Объект] необходимо выбрать договор брокерского обслуживания или документ [Поручение на перевод денежных средств]!", ЭтотОбъект, "Объект",, Отказ);		
		Возврат;
		
	КонецЕсли;
	
	Если (ВидАкцепта = Перечисления.ВидыАкцептов.СписаниеБрокерскойКомиссии Или ВидАкцепта = Перечисления.ВидыАкцептов.СписаниеТорговойКомиссии) 
		И ТипЗнч(ЭтотОбъект.Объект) <> Тип("СправочникСсылка.ДоговорыБрокерскогоОбслуживания")
		И ТипЗнч(ЭтотОбъект.Объект) <> Тип("СправочникСсылка.Договоры") Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для вида акцепта [" + СокрЛП(ВидАкцепта) + "] в поле [Объект] необходимо выбрать договор брокерского обслуживания!", ЭтотОбъект, "Объект",, Отказ);		
		Возврат;
		
	КонецЕсли;
	
	Если (ВидАкцепта = Перечисления.ВидыАкцептов.СписаниеКомиссииБанка Или ВидАкцепта = Перечисления.ВидыАкцептов.СМО) 
		И ТипЗнч(ЭтотОбъект.Объект) <> Тип("СправочникСсылка.БанковскиеСчета") Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для вида акцепта [" + СокрЛП(ВидАкцепта) + "] в поле [Объект] необходимо выбрать банковский счет!", ЭтотОбъект, "Объект",, Отказ);		
		Возврат;
		
	КонецЕсли;

	Если Не (РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Или ПометкаУдаления) Тогда
		
		ПроверитьДублированиеАкцепта(Отказ); 
				
		Если Не Отказ И ЗначениеЗаполнено(ЭтотОбъект.Объект) И ТипыКороткихАкцептов.Найти(ТипЗнч(ЭтотОбъект.Объект)) <> Неопределено Тогда
			Отказ = КонфликтВремениАкцептаИОбъекта(ЭтотОбъект.Объект, ЭтотОбъект.Дата);
		КонецЕсли;
			
	КонецЕсли;	
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если Не Отказ Тогда
		
		РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);
			
		Если ЭтотОбъект.ВидАкцепта = Перечисления.ВидыАкцептов.ПоручениеНаВыводАктивов 
			И ТипЗнч(ЭтотОбъект.Объект) = Тип("ДокументСсылка.ПоручениеНаДвижениеДенежныхСредств") Тогда
			
			Если ЭтотОбъект.ДополнительныеСвойства.ЭтоНовый Или ЭтотОбъект.ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения 
				Или РаботаСДокументами.ИзмененыРеквизитыШапкиДокумента(ЭтотОбъект, "СчетДоверительногоУправления, ВидАкцепта, Объект")
				И ЭтотОбъект.ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
				
				ПарметрыРегламентногоЗадания = Новый Структура("Организация, Поручение, ЭтоНовый", ЭтотОбъект.Организация, ЭтотОбъект.Объект, ЭтотОбъект.ДополнительныеСвойства.ЭтоНовый);		
				Обработки.СогласованиеПредстоящихРасходов.СоздатьОтложенноеЗаданиеФормированияОповещения("СформироватьОповещенияОСогласованныхПорученияхНаВыводДС", ПарметрыРегламентногоЗадания);
				
			КонецЕсли;
			
		ИначеЕсли ЭтотОбъект.ВидАкцепта = Перечисления.ВидыАкцептов.ПереводСБрокерскогоСчетаНаРасчетный 
			И ТипЗнч(ЭтотОбъект.Объект) = Тип("ДокументСсылка.ПоручениеНаПереводДенежныхСредств") И ЭтотОбъект.ДополнительныеСвойства.ЭтоНовый Тогда 
			
			БлокировкаДанных = Новый БлокировкаДанных();
			ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.СтатусыПорученийНаПереводДенежныхСредств");
			ЭлементБлокировки.УстановитьЗначение("ПоручениеНаПереводДенежныхСредств", ЭтотОбъект.Объект);
			БлокировкаДанных.Заблокировать();

			ТекущийСтатус = РаботаСДокументами.ПолучитьТекущийСтатусПорученияНаПереводДенежныхСредств(ЭтотОбъект.Объект);

			Если ТекущийСтатус = Перечисления.СтатусыПорученийНаПереводДенежныхСредств.ОжидаетАкцепта Тогда	
				РегистрыСведений.СтатусыПорученийНаПереводДенежныхСредств.УстановитьСтатусПоручения(ЭтотОбъект.Объект, Перечисления.СтатусыПорученийНаПереводДенежныхСредств.ГотовКОтправке);
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя акцептовывать поручения со статусом [" + ТекущийСтатус + "]", ЭтотОбъект, "Объект",, Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	РаботаСДокументами.СформироватьДвиженияПоРегистрамБэкОфиса(ЭтотОбъект, Отказ);
			
КонецПроцедуры 

#КонецОбласти

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ

Функция ПолучитьСчетДУИзРеестраПлатежей(Основание)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	РеестрПлатежей.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ИЗ
		|	РегистрСведений.РеестрПлатежей КАК РеестрПлатежей
		|ГДЕ
		|	РеестрПлатежей.СтрокаБанковскойВыписки = &Основание";
	
	Запрос.УстановитьПараметр("Основание", Основание);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СчетДоверительногоУправления;
	Иначе
		Возврат Справочники.СчетаДоверительногоУправления.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции // ПолучитьСчетДУИзРеестраПлатежей()

Процедура ПроверитьДублированиеАкцепта(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	АкцептованиеОпераций.Операция КАК Операция,
		|	АкцептованиеОпераций.ВидАкцепта КАК ВидАкцепта,
		|	АкцептованиеОпераций.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.АкцептованиеОпераций КАК АкцептованиеОпераций
		|ГДЕ
		|	АкцептованиеОпераций.Организация = &Организация
		|	И АкцептованиеОпераций.Операция = &Операция
		|	И НАЧАЛОПЕРИОДА(АкцептованиеОпераций.Период, ДЕНЬ) = &Период
		|	И АкцептованиеОпераций.ВидАкцепта = &ВидАкцепта
		|	И АкцептованиеОпераций.Регистратор <> &Ссылка";			
	
	Запрос.УстановитьПараметр("Ссылка", 					ЭтотОбъект.Ссылка);			
	Запрос.УстановитьПараметр("Организация", 				ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ВидАкцепта", 				ЭтотОбъект.ВидАкцепта);
	Запрос.УстановитьПараметр("Операция",	 				ЭтотОбъект.Объект);
	Запрос.УстановитьПараметр("Период", 					НачалоДня(ЭтотОбъект.Дата));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для объекта " + СокрЛП(ЭтотОбъект.Объект) + " уже создан документ " + СокрЛП(Выборка.Регистратор) + ?(ЭтотОбъект.ВидАкцепта = Перечисления.ВидыАкцептов.ПустаяСсылка(), "", " вида '" + СокрЛП(ЭтотОбъект.ВидАкцепта) + "' ") + " на дату " + Формат(ЭтотОбъект.Дата, "ДЛФ=DT"), Выборка.Регистратор,,, Отказ);
	КонецЕсли;	
		
КонецПроцедуры   

Функция КонфликтВремениАкцептаИОбъекта(АкцептуемыйОбъект, Дата)
	
	ЕстьКонфликт = Ложь;
	
	Если (ТипЗнч(АкцептуемыйОбъект) = Тип("ДокументСсылка.СтрокаБанковскойВыписки")) Тогда
		
		ДокументыДвиженияДенег = ПолучитьДокументыДвиженияДенегПоВыписке(АкцептуемыйОбъект);
		
		Для Каждого ДокументДвиженияДенег Из ДокументыДвиженияДенег Цикл
			
			ПроверитьВремяАкцептаИОбъекта(Дата, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументДвиженияДенег, "Дата"), ЕстьКонфликт);
			
			Если ЕстьКонфликт Тогда 
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(АкцептуемыйОбъект) = Тип("ДокументСсылка.Распоряжение")
		Или ТипЗнч(АкцептуемыйОбъект) = Тип("ДокументСсылка.ПоручениеНаПереводДенежныхСредств") Тогда
		
		ДатаОбъектаАкцептования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АкцептуемыйОбъект, "Дата");
		
		Если НачалоДня(Дата) < НачалоДня(ДатаОбъектаАкцептования) Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата акцепта [" + Формат(Дата, "ДФ=dd.MM.yyyy") + "] меньше даты акцептуемого распоряжения [" + АкцептуемыйОбъект + "].",,,, ЕстьКонфликт);
		ИначеЕсли Дата < ДатаОбъектаАкцептования Тогда  
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Время акцепта [" + Формат(Дата, "ДФ=ЧЧ.мм.сс") + "] меньше времени [" + Формат(ДатаОбъектаАкцептования, "ДФ=ЧЧ.мм.сс") + "] акцептуемого распоряжения [" + АкцептуемыйОбъект + "].",,,, ЕстьКонфликт);	
		КонецЕсли;
		
	Иначе
		ПроверитьВремяАкцептаИОбъекта(Дата, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АкцептуемыйОбъект, "Дата"), ЕстьКонфликт);	 
	КонецЕсли;
	
	Возврат ЕстьКонфликт;
	
КонецФункции

Функция ПолучитьДокументыДвиженияДенегПоВыписке(Операция) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеестрПлатежей.ДвижениеДенежныхСредств
		|ИЗ
		|	РегистрСведений.РеестрПлатежей КАК РеестрПлатежей
		|ГДЕ
		|	РеестрПлатежей.СтрокаБанковскойВыписки = &СтрокаБанковскойВыписки";
	
	Запрос.УстановитьПараметр("СтрокаБанковскойВыписки", Операция);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ДвижениеДенежныхСредств");
	
КонецФункции

Функция ПроверитьВремяАкцептаИОбъекта(ДатаАкцепта, ДатаОбъекта, Отказ)
	
	Если ДатаОбъекта <= ДатаАкцепта Тогда
		
		Если НачалоДня(ДатаАкцепта) < Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, НачалоДня(ТекущаяДата()), -2) Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"Время документа раньше времени акцепта, и документ в закрытом периоде. Необходимо обратиться к программистам.",,,, Отказ);
			
		ИначеЕсли НачалоДня(ДатаОбъекта) < НачалоДня(ДатаАкцепта) Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"Дата документа [" + Формат(ДатаОбъекта, "ДФ=dd.MM.yyyy") + "] раньше даты акцепта [" + Формат(ДатаАкцепта, "ДФ=dd.MM.yyyy") + "]. Возможно, ошибка в дате акцепта",,,, Отказ);
			
		КонецЕсли;
		
	КонецЕсли;

КонецФункции

#КонецОбласти
